## 6. Decision Trees and Ensemble Learning

In [152]:
import pandas as pd
import numpy as np

import seaborn as sns
from matplotlib import pyplot as plt
%matplotlib inline

### 6.2 Data cleaning and preparation

* Downloading the dataset
* Re-encoding the categorical variables
* Doing the train/validation/test split

In [153]:
data = 'https://raw.githubusercontent.com/alexeygrigorev/mlbookcamp-code/master/chapter-06-trees/CreditScoring.csv'

In [154]:
#!wget $data

In [155]:
df = pd.read_csv('CreditScoring.csv')

In [156]:
df

,Status,Seniority,Home,Time,Age,Marital,Records,Job,Expenses,Income,Assets,Debt,Amount,Price
0,1,9,1,60,30,2,1,3,73,129,0,0,800,846
1,1,17,1,60,58,3,1,1,48,131,0,0,1000,1658
2,2,10,2,36,46,2,2,3,90,200,3000,0,2000,2985
3,1,0,1,60,24,1,1,1,63,182,2500,0,900,1325
4,1,0,1,36,26,1,1,1,46,107,0,0,310,910
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4450,2,1,1,60,39,2,1,1,69,92,0,0,900,1020
4451,1,22,2,60,46,2,1,1,60,75,3000,600,950,1263
4452,2,0,2,24,37,2,1,2,60,90,3500,0,500,963
4453,1,0,1,48,23,1,1,3,49,140,0,0,550,550
4454,1,5,2,60,32,2,1,3,60,140,4000,1000,1350,1650

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4455 entries, 0 to 4454
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Status     4455 non-null   int64
 1   Seniority  4455 non-null   int64
 2   Home       4455 non-null   int64
 3   Time       4455 non-null   int64
 4   Age        4455 non-null   int64
 5   Marital    4455 non-null   int64
 6   Records    4455 non-null   int64
 7   Job        4455 non-null   int64
 8   Expenses   4455 non-null   int64
 9   Income     4455 non-null   int64
 10  Assets     4455 non-null   int64
 11  Debt       4455 non-null   int64
 12  Amount     4455 non-null   int64
 13  Price      4455 non-null   int64
dtypes: int64(14)
memory usage: 487.4 KB

In [158]:
df.columns = df.columns.str.lower()

In [159]:
for c in df.columns:
    print(df[c].value_counts())

status
1    3200
2    1254
0       1
Name: count, dtype: int64
seniority
0     535
1     510
2     454
3     336
5     266
10    236
4     233
6     181
8     163
15    159
20    151
7     137
12    133
14    114
11    105
13     91
9      80
18     65
16     62
25     62
17     56
30     49
22     41
19     39
23     26
21     23
24     19
40     14
28     14
27     14
26     14
35     13
29     11
31     10
32     10
33      5
38      5
37      4
36      4
45      3
43      2
41      1
42      1
48      1
47      1
39      1
34      1
Name: count, dtype: int64
home
2    2107
1     973
5     783
6     319
3     247
4      20
0       6
Name: count, dtype: int64
time
60    1933
36     942
48     860
24     350
12     148
18      93
30      49
6       33
42      29
54      17
72       1
Name: count, dtype: int64
age
28    178
26    163
32    159
30    156
34    155
31    153
27    153
24    152
36    145
37    144
25    143
33    141
40    139
38    135
29    131
23    128
39    126
35    120
41    114
42    113
22    113
46     95
43     93
47     91
49     90
45     88
51     83
52     82
21     82
50     81
44     78
53     70
55     65
48     60
54     58
20     49
56     48
58     40
59     34
60     34
57     31
19     28
61     27
63     22
62     20
64     14
65     12
66      9
18      8
68      2
Name: count, dtype: int64
marital
2    3241
1     978
4     130
3      67
5      38
0       1
Name: count, dtype: int64
records
1    3682
2     773
Name: count, dtype: int64
job
1    2806
3    1024
2     452
4     171
0       2
Name: count, dtype: int64
expenses
35     1212
45      823
60      792
75      570
90      192
       ...
180       1
99        1
168       1
37        1
106       1
Name: count, Length: 94, dtype: int64
income
0      347
100    153
150    114
120    107
80      87
      ...
531      1
349      1
371      1
21       1
267      1
Name: count, Length: 353, dtype: int64
assets
0         1627
4000       343
5000       286
3000       271
3500       192
          ...
2900         1
78000        1
59000        1
120000       1
53500        1
Name: count, Length: 160, dtype: int64
debt
0        3670
2000       59
1500       51
3000       46
1000       39
         ...
4750        1
7200        1
42          1
6500        1
23500       1
Name: count, Length: 183, dtype: int64
amount
1000    542
1200    221
800     219
1100    210
1300    200
       ...
1065      1
1543      1
1720      1
1442      1
1460      1
Name: count, Length: 285, dtype: int64
price
1500    46
1200    45
1300    45
1600    43
1100    41
        ..
2072     1
1704     1
1577     1
915      1
1186     1
Name: count, Length: 1419, dtype: int64

In [160]:
df.status.value_counts()

status
1    3200
2    1254
0       1
Name: count, dtype: int64

In [161]:
status_values = {
    1: 'ok',
    2: 'default',
    0: 'unk'
}

df['status'] = df['status'].map(status_values)

In [162]:
home_values = {
    1: 'rent',
    2: 'owner',
    3: 'private',
    4: 'ignore',
    5: 'parents',
    6: 'other',
    0: 'unk'
}
df['home'] = df['home'].map(home_values)

marital_values = {
    1: 'single',
    2: 'married',
    3: 'widow',
    4: 'separated',
    5: 'divorced',
    0: 'unk'
}

df['marital'] = df['marital'].map(marital_values)

records_values = {
    1: 'no',
    2: 'yes',
    0: 'unk'
}

df['records'] = df['records'].map(records_values)

job_values = {
    1: 'fixed',
    2: 'partime',
    3: 'freelance',
    4: 'others',
    0: 'unk'
}

df['job'] = df['job'].map(job_values)

In [163]:
df.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,ok,9,rent,60,30,married,no,freelance,73,129,0,0,800,846
1,ok,17,rent,60,58,widow,no,fixed,48,131,0,0,1000,1658
2,default,10,owner,36,46,married,yes,freelance,90,200,3000,0,2000,2985
3,ok,0,rent,60,24,single,no,fixed,63,182,2500,0,900,1325
4,ok,0,rent,36,26,single,no,fixed,46,107,0,0,310,910

In [164]:
df.describe().round()

,seniority,time,age,expenses,income,assets,debt,amount,price
count,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0,4455.0
mean,8.0,46.0,37.0,56.0,763317.0,1060341.0,404382.0,1039.0,1463.0
std,8.0,15.0,11.0,20.0,8703625.0,10217569.0,6344253.0,475.0,628.0
min,0.0,6.0,18.0,35.0,0.0,0.0,0.0,100.0,105.0
25%,2.0,36.0,28.0,35.0,80.0,0.0,0.0,700.0,1118.0
50%,5.0,48.0,36.0,51.0,120.0,3500.0,0.0,1000.0,1400.0
75%,12.0,60.0,45.0,72.0,166.0,6000.0,0.0,1300.0,1692.0
max,48.0,72.0,68.0,180.0,99999999.0,99999999.0,99999999.0,5000.0,11140.0

In [165]:
for c in ['income', 'assets', 'debt']:
    df[c] = df[c].replace(to_replace=99999999, value=np.nan)

In [166]:
df = df[df.status!='unk'].reset_index(drop=True)

#### split the data

In [167]:
from sklearn.model_selection import train_test_split

In [168]:
df_full_train, df_test = train_test_split(df, test_size=0.2, random_state=11)
df_train, df_val = train_test_split(df_full_train, test_size=0.25, random_state=11)

In [169]:
df_train = df_train.reset_index(drop=True)
df_val = df_full_train.reset_index(drop=True)
df_test = df_val.reset_index(drop=True)

In [170]:
y_train = (df_train.status == 'default').astype('int').values
y_val = (df_val.status == 'default').astype('int').values
y_test = (df_test.status == 'default').astype('int').values

In [171]:
del df_train['status']
del df_val['status']
del df_test['status']